In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
# Dataframe is basically multiple series that share the same index

In [4]:
# creating some dataframe with random normal data

data = np.random.randn(5, 4)
cols = ['A', 'B', 'C', 'D']

# creating dataframe (df) by seperatly passing data and column names
# we can also create dataframe using python dictionary
df = pd.DataFrame(data = data, columns=cols)

In [5]:
# cols A, B, C, D are Series object that share the same index
df

          A         B         C         D
0  1.155577 -0.735892 -1.103382  0.548971
1  0.846687 -0.622908 -0.650999  0.497383
2 -0.297113 -1.099880  1.850526  0.206400
3 -0.224547 -0.612541  0.180957 -1.845102
4 -1.606610 -1.507686  1.903333  0.061534

In [6]:
# Manually assigning index

index = 'U V W X Y'.split()

df.index = index

In [7]:
df

          A         B         C         D
U  1.155577 -0.735892 -1.103382  0.548971
V  0.846687 -0.622908 -0.650999  0.497383
W -0.297113 -1.099880  1.850526  0.206400
X -0.224547 -0.612541  0.180957 -1.845102
Y -1.606610 -1.507686  1.903333  0.061534

In [8]:
# Now accessing a particular column
# it is just like python dictionary
df['A']

U    1.155577
V    0.846687
W   -0.297113
X   -0.224547
Y   -1.606610
Name: A, dtype: float64

In [9]:
# Now accessing multiple columns

df[ ['A', 'B', 'D'] ]

          A         B         D
U  1.155577 -0.735892  0.548971
V  0.846687 -0.622908  0.497383
W -0.297113 -1.099880  0.206400
X -0.224547 -0.612541 -1.845102
Y -1.606610 -1.507686  0.061534

In [10]:
# Creating new column 

# it will create new column called E and will do elementwise sum of cols A and B 
df['E'] = df['A'] + df['B']

In [11]:
df

          A         B         C         D         E
U  1.155577 -0.735892 -1.103382  0.548971  0.419685
V  0.846687 -0.622908 -0.650999  0.497383  0.223779
W -0.297113 -1.099880  1.850526  0.206400 -1.396992
X -0.224547 -0.612541  0.180957 -1.845102 -0.837087
Y -1.606610 -1.507686  1.903333  0.061534 -3.114295

In [12]:
# Now deleting a column

# by default it is set to delete rows ( i.e axis = 0 ), if you want to delete column set (axis = 1)
# also this will return new dataframe with E column removed, inorder to do it in same dataframe set inplace=True
df.drop('E', axis = 1, inplace = True)

In [13]:
df

          A         B         C         D
U  1.155577 -0.735892 -1.103382  0.548971
V  0.846687 -0.622908 -0.650999  0.497383
W -0.297113 -1.099880  1.850526  0.206400
X -0.224547 -0.612541  0.180957 -1.845102
Y -1.606610 -1.507686  1.903333  0.061534

In [14]:
# For deleting particular row 
# say Xth row

# by default it is set to axis = 0
df.drop('X', inplace = True)

In [15]:
df

          A         B         C         D
U  1.155577 -0.735892 -1.103382  0.548971
V  0.846687 -0.622908 -0.650999  0.497383
W -0.297113 -1.099880  1.850526  0.206400
Y -1.606610 -1.507686  1.903333  0.061534

In [16]:
# Now we know how to access col, add col, drop col and drop row

# Now accessing particular row
df.loc['U']

A    1.155577
B   -0.735892
C   -1.103382
D    0.548971
Name: U, dtype: float64

In [17]:
# accessing multiple rows
df.loc[ ['U', 'Y'] ]

          A         B         C         D
U  1.155577 -0.735892 -1.103382  0.548971
Y -1.606610 -1.507686  1.903333  0.061534

In [18]:
# Now instead of accessing row by index name, we can access by integer index

# iloc means integer based location
# it will return 0th and 2nd row
df.iloc[ [0, 2] ]

          A         B         C         D
U  1.155577 -0.735892 -1.103382  0.548971
W -0.297113 -1.099880  1.850526  0.206400

In [19]:
# Now accessing subset of data
# selecting A, B column and U, W row

# This will select first U, W row and this will return dataframe and then finally selecting A and B column
df.loc[ ['U', 'W'] ][ ['A', 'B'] ]

          A         B
U  1.155577 -0.735892
W -0.297113 -1.099880

In [20]:
# Another way of doing this

# this is numpy like indexing  first rows, columns
df.loc[ ['U', 'W'], ['A', 'B'] ]

          A         B
U  1.155577 -0.735892
W -0.297113 -1.099880

In [21]:
# Now performing some conditions on dataframe

# this will return boolean of dataframe
df > 0

       A      B      C     D
U   True  False  False  True
V   True  False  False  True
W  False  False   True  True
Y  False  False   True  True

In [22]:
# now getting values with this condition

# it will return values where df > 0, ( broadcasting is done here )
df[ df > 0 ]

          A   B         C         D
U  1.155577 NaN       NaN  0.548971
V  0.846687 NaN       NaN  0.497383
W       NaN NaN  1.850526  0.206400
Y       NaN NaN  1.903333  0.061534

In [23]:
# applying condition on specific column, and most of the times we will be doing that :D

df['A'] > 0

U     True
V     True
W    False
Y    False
Name: A, dtype: bool

In [24]:
# selecting all the rows where value of A > 0
df[ df['A'] > 0 ]

          A         B         C         D
U  1.155577 -0.735892 -1.103382  0.548971
V  0.846687 -0.622908 -0.650999  0.497383

In [25]:
# if you want particular column

df[ df['A'] > 0 ][ ['A', 'C'] ]

          A         C
U  1.155577 -1.103382
V  0.846687 -0.650999

In [26]:
# applying mulitple conditions on dataframe
# and it is pandas requires that you keep all the conditions in the brackets
# df[ df['A'] < 0 & df['C'] < 0 ] -> this will return error as there are no brackets

# selecting all cols where A < 0 and C < 0; 
df[ (df['A'] < 0) & (df['C'] < 0) ]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [27]:
# selecting all cols where A < 0 or C < 0; 

df[ (df['A'] < 0) | (df['C'] < 0) ]

          A         B         C         D
U  1.155577 -0.735892 -1.103382  0.548971
V  0.846687 -0.622908 -0.650999  0.497383
W -0.297113 -1.099880  1.850526  0.206400
Y -1.606610 -1.507686  1.903333  0.061534

In [28]:
# now if you want to create the current index as a column
# by default it will create that new columns and name it as index
df.reset_index(inplace = True)

In [29]:
df

  index         A         B         C         D
0     U  1.155577 -0.735892 -1.103382  0.548971
1     V  0.846687 -0.622908 -0.650999  0.497383
2     W -0.297113 -1.099880  1.850526  0.206400
3     Y -1.606610 -1.507686  1.903333  0.061534

In [30]:
# inorder to create a column as index
# setting the index column as index of df
df.set_index(df['index'], inplace = True)

In [31]:
df

      index         A         B         C         D
index
U         U  1.155577 -0.735892 -1.103382  0.548971
V         V  0.846687 -0.622908 -0.650999  0.497383
W         W -0.297113 -1.099880  1.850526  0.206400
Y         Y -1.606610 -1.507686  1.903333  0.061534

In [32]:
df.drop('index', axis = 1, inplace = True)

In [33]:
df

              A         B         C         D
index
U      1.155577 -0.735892 -1.103382  0.548971
V      0.846687 -0.622908 -0.650999  0.497383
W     -0.297113 -1.099880  1.850526  0.206400
Y     -1.606610 -1.507686  1.903333  0.061534

In [34]:
# now getting some information about dataframe

df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, U to Y
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      float64
 2   C       4 non-null      float64
 3   D       4 non-null      float64
dtypes: float64(4)
memory usage: 160.0+ bytes

In [35]:
# the more descriptive stats 
df.describe()

              A         B         C         D
count  4.000000  4.000000  4.000000  4.000000
mean   0.024636 -0.991591  0.499869  0.328572
std    1.254230  0.399745  1.600926  0.233315
min   -1.606610 -1.507686 -1.103382  0.061534
25%   -0.624487 -1.201831 -0.764095  0.170184
50%    0.274787 -0.917886  0.599763  0.351892
75%    0.923910 -0.707646  1.863727  0.510280
max    1.155577 -0.622908  1.903333  0.548971

In [36]:
# adding one categorical column to show some more useful and commonly used methods

df['categorical'] = ['first_category'] * 1 + ['second_category'] * 3

In [37]:
df

              A         B         C         D      categorical
index
U      1.155577 -0.735892 -1.103382  0.548971   first_category
V      0.846687 -0.622908 -0.650999  0.497383  second_category
W     -0.297113 -1.099880  1.850526  0.206400  second_category
Y     -1.606610 -1.507686  1.903333  0.061534  second_category

In [38]:
# now getting the count of each category
df['categorical'].value_counts()

second_category    3
first_category     1
Name: categorical, dtype: int64

In [39]:
# Now dealing with missing data
# You can fill the missing data by 3 ways
# 1) keep the missing data as it is, if the forecasting algorithms can handle it
# 2) drop the entire sample, including the timestamp
# 3) replace it with the best estimate ( can differ based on problem, can use mean, median, or any method u r comformtable with )

# but fortunately most of the time series datasets will do not contain missing values
# as data is entered and timestamped

nan_df = pd.DataFrame({'A': [1, 2, np.nan, 4], 'B': [5, np.nan, 7, np.nan]})
nan_df

     A    B
0  1.0  5.0
1  2.0  NaN
2  NaN  7.0
3  4.0  NaN

In [40]:
# dropping all the rows containing nan values
nan_df.dropna()

     A    B
0  1.0  5.0

In [41]:
# to drop the column containing nan values, it will drop all the columns in this df :|
nan_df.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [42]:
# now dropping rows if and only if it contains 'k' number of nan's
# here k = 2, means if row contains atleast 2 nan's then only drop that row
nan_df.dropna(thresh=2)

     A    B
0  1.0  5.0

In [43]:
# filling it with some estimate like mean
nan_df.fillna(value = nan_df.mean())

          A    B
0  1.000000  5.0
1  2.000000  6.0
2  2.333333  7.0
3  4.000000  6.0

In [44]:
# Now using groupby
# this is basically splitting first based on some column, then aggregating by some function like mean, sum, etc

df

              A         B         C         D      categorical
index
U      1.155577 -0.735892 -1.103382  0.548971   first_category
V      0.846687 -0.622908 -0.650999  0.497383  second_category
W     -0.297113 -1.099880  1.850526  0.206400  second_category
Y     -1.606610 -1.507686  1.903333  0.061534  second_category

In [45]:
# now this will split by categorical column and then aggregating by mean 
df.groupby('categorical').mean()

                        A         B         C         D
categorical
first_category   1.155577 -0.735892 -1.103382  0.548971
second_category -0.352345 -1.076824  1.034286  0.255106

In [46]:
# instead, since the returned is dataframe only, use describe function simply :D
df.groupby('categorical').describe()

                    A                                                    \
                count      mean       std       min       25%       50%
categorical
first_category    1.0  1.155577       NaN  1.155577  1.155577  1.155577
second_category   3.0 -0.352345  1.227581 -1.606610 -0.951861 -0.297113

                                        B            ...         C            \
                      75%       max count      mean  ...       75%       max
categorical                                          ...
first_category   1.155577  1.155577   1.0 -0.735892  ... -1.103382 -1.103382
second_category  0.274787  0.846687   3.0 -1.076824  ...  1.876929  1.903333

                    D                                                    \
                count      mean       std       min       25%       50%
categorical
first_category    1.0  0.548971       NaN  0.548971  0.548971  0.548971
second_category   3.0  0.255106  0.221969  0.061534  0.133967  0.206400


                      75%       max
categorical
first_category   0.548971  0.548971
second_category  0.351892  0.497383

[2 rows x 32 columns]

In [47]:
# the above will be more intuitive if we transposed it
df.groupby('categorical').describe().transpose()

categorical  first_category  second_category
A count            1.000000         3.000000
  mean             1.155577        -0.352345
  std                   NaN         1.227581
  min              1.155577        -1.606610
  25%              1.155577        -0.951861
  50%              1.155577        -0.297113
  75%              1.155577         0.274787
  max              1.155577         0.846687
B count            1.000000         3.000000
  mean            -0.735892        -1.076824
  std                   NaN         0.442839
  min             -0.735892        -1.507686
  25%             -0.735892        -1.303783
  50%             -0.735892        -1.099880
  75%             -0.735892        -0.861394
  max             -0.735892        -0.622908
C count            1.000000         3.000000
  mean            -1.103382         1.034286
  std                   NaN         1.459739
  min             -1.103382        -0.650999
  25%             -1.103382         0.599763
  50%             -1.103382         1.850526
  75%             -1.103382         1.876929
  max             -1.103382         1.903333
D count            1.000000         3.000000
  mean             0.548971         0.255106
  std                   NaN         0.221969
  min              0.548971         0.061534
  25%              0.548971         0.133967
  50%              0.548971         0.206400
  75%              0.548971         0.351892
  max              0.548971         0.497383